/*********************************************************************
程序名：熟悉准备在学习中使用的开发工具
版权：遵从GPL版权协议，可自由使用和传播（请勿上传到收费性网络文库）
作者：anbangli@foxmail.com
日期：2019-08-09
说明：

prog1-2.输入本章例1-1正文中给出的简单程序例子（注意程序格式），注意书写
时要使用英文字符（区分大小写），而不能使用中文字符（中文字符只能出现在
由一对英文双引号括起来的字符串里，或者注释里）。
编写完成之后保存文件，然后进行加工，如果有错误则排除错误，直到加工成功。
运行程序并查看它的效果（输出了什么信息等）。
*********************************************************************/
#include <iostream>
using namespace std;

int main() {
	cout << "Hello, world!" << endl;

	return 0;
}


