/*********************************************************************
程序名：熟悉准备在学习中使用的开发工具
版权：遵从GPL版权协议，可自由使用和传播（请勿上传到收费性网络文库）
作者：anbangli@foxmail.com
日期：2019-08-09
说明：

prog1-1.熟悉准备在学习中使用的开发工具，例如本书1.4节介绍的集成开发环境
Dev-C++，或其他支持C/C++ 编程的语言系统。了解该系统的基本使用方法、基本
操作（命令式或窗口菜单的图形界面方式），弄清楚如何取得联机帮助信息。设法
找到并翻阅该系统的手册，了解手册的结构和各个部分的基本内容。了解在该系统
中编写一个简单程序的基本步骤。

*********************************************************************/

首次学习使用一个新软件时，先花时间了解这个软件的菜单和工具栏：

（1）鼠标点击菜单“文件”，看一看（不要进行点击操作）弹出的各个菜单项的名称。
然后把鼠标依次移动到菜单“编辑”、“搜索”……，看一看弹出的各个菜单项的名称。
（变灰的菜单是当前不可用）

（2）把鼠标 悬 浮 （不要进行点击操作）在工具栏的各个按钮上方，稍等 0.5 秒钟
之后就会浮现该按钮的简要帮助信息。花点时间依次看一看各个按钮的简要帮助信息。
以后可以主要使用工具栏按钮进行操作。

（至少应该花10分钟时间，耐心地进行以上操作，并尽可能记住各个菜单项和工具按钮
的名称，若有可能，尽量记住相应的快捷键！——因为以后经常要使用这个软件的菜单
和工具栏上的各种功能。）

做完了上述操作之后，可以点击菜单“帮助”，点击里面的各个菜单项。
有些是简单介绍本软件的开发者，有些是简单的技巧说明，有些是详细的说明。
先大致地看一看，不需详细了解，以后有必要的时候再回头来阅读。 

