/*********************************************************************
程序名：输出星号图案
版权：遵从GPL版权协议，可自由使用和传播（请勿上传到收费性网络文库）
作者：anbangli@foxmail.com
日期：2019-08-09
说明：
prog3-13.使用循环语句，在屏幕上打印输出如下图案：
* 
* * 
* * * 
* * * *
* * * 
* * 
* 
*********************************************************************/
#include <iostream>
#include <cmath>
#include <iomanip>
using namespace std;

int main() {
	int a = 1, b = 6; 	//表示行数和列数的最小值和最大值 
	int i, j;	//循环变量 
	
	//把待输出图形视为两部分：上半部分是从少到多，下半部分是从多到少
	cout << "解法1：用两个二重循环分别输出这两部分\n";
	for (i = a; i <= b; i++) {	// i 从 a 递增到 b
	//外层循环控制输出多个星号和一个回车符，所以要有一个复合结构。 
		for (j = a; j <= i; j++)
			cout << "* ";
		cout << "\n" ;
	}
	for (i = b - 1; i >= a; i--) {	//i 从 b -1 递减到 a 
		for (j = a; j <= i; j++)
			cout << "* ";
		cout << "\n" ;
	}
	
	cout << "\n解法2：用一个二重循环完成\n";
	int k; 	//此时需要一个变量控制内层循环的个数 
	for (i = a; i <= 2 * b - 1; i++) {	// i 从 a 递增到 2b-1
		if (i <= b)
			k = i;
		else
			k = 2 * b -i;
		for (j = 1; j <= k; j++)	//j 从 1 递增到 k 
			cout << "* ";
		cout << "\n" ;
	}
	
	
	return 0;
}


