/*********************************************************************
程序名：“筛法”程序改进
版权：遵从GPL版权协议，可自由使用和传播（请勿上传到收费性网络文库）
作者：anbangli@foxmail.com
日期：2019-07-10 17:33
说明：6-4.正文中的“筛法”程序中，求得的质数是在数组 an 中元素值为 1
的那些下标值。请对该程序添加功能，把求得的质数复制到数组 bn 中（即让该
数组的元素依次为所求得的质数：2, 3, 5, 7, ...）。
*********************************************************************/
#include <iostream>
using namespace std;

int main () {    //筛法求素数
    const int NUM = 200;
    int an[NUM + 1];	//共NUM+1个元素，下标从0到NUM
    int i, j;

    //数组初始化：用1表示未划掉，用0表示已被划掉
    //an[0] = an[1] = 0; //0和1不是素数
    for (i = 2; i <= NUM; ++i)    //开始时数组元素设置为1
        an[i] = 1;

    for (i = 2; i * i <= NUM; ++i) 	//筛法
        if (an[i] == 1)
            for (j = i * 2; j <= NUM; j += i)
                an[j] = 0;

    //把求得的质数到数组 bn 中
    int bn[NUM] = {0};	//定义数组 bn 并全部初始化为 0
    for (i = 2, j = 0; i <= NUM; ++i)
        if (an[i] != 0)	{
            bn[j] = i;
            j++;
        }

    //输出 bn
    for (j = 0; j < NUM && bn[j] > 0; ++j)
        cout << bn[j] << (j % 10 != 9 ? '\t' : '\n');
    cout << "\n总个数：" << j << endl;

    return 0;
}
