/*********************************************************************
程序名：常见编译错误处理 
版权：遵从GPL版权协议，可自由使用和传播（请勿上传到收费性网络文库）
作者：anbangli@foxmail.com
日期：2019-08-09
说明：
 
prog1-3.修改上一题完成的程序，尝试1.4节中作为例子介绍的各种程序错误，
加工程序，阅读并设法理解系统产生的出错信息。

解题说明：根据教材所示图片对已经能够正常编译运行的程序进行修改，改成
含有图片中所示的错误，并进行编译；当然这时会出现错误信息，要耐心地阅读
并理解这些信息。 ——此题的目的是，以后遇到类似错误时能迅速处理。 
*********************************************************************/
#include <iostream>
using namespace std;

int main() {
	cout << "Hello, world!" << endl;

	return 0;
}


