/*********************************************************************
程序名：单词统计3 
版权：遵从GPL版权协议，可自由使用和传播（请勿上传到收费性网络文库）
作者：anbangli@foxmail.com
日期：2019-07-24
说明：
8-10.在实现单词计数时（假设为英文单词）考虑下面的改进技术：
（1）定义一个指针数组 LINK table[26]，数组里的每个指针指向一个结点表；
（2）按照单词的首字母将读入的单词分别存入指针数组 table 的不同元素所
指向的链接表里，在读入单词后查找存入表之前将单词里所有大写字母改为小
写字母。通过处理很大的文本，比较这一实现与本章正文中所提出的实现的性能。
*********************************************************************/
#include <iostream>
#include <cstring>
#include <fstream>
using namespace std;

int main() {
	cout << "此程序尚未编写完成";
    return 0;
}

