/*********************************************************************
程序名：关系表达式和逻辑表达式求值
版权：遵从GPL版权协议，可自由使用和传播（请勿上传到收费性网络文库）
作者：anbangli@foxmail.com
日期：2019-08-09
说明：
3-4.假设整型变量 a 的值是 1，b 的值是 2，c 的值是 0，在这种情况下先用手工
计算下面各个表达式的值，然后编写程序计算输出各个表达式的值，验证手工计算
结果是否正确。
(1) (a > b) && (b > c)
(2) (a > b) || !(a < b < c)
(3) !(a && b) || !(b || c)
(4) !(a + b < c) && b <= c * a - b
(5) a && !((b || c) && !a)

解题分析：把每个表达式分解为关系表达式和简单的逻辑表达式，根据规则逐个求值。 
**********************************************************************/
#include <iostream>
using namespace std;

int main() {
	cout << "关系表达式和逻辑表达式求值\n";
	
	int a = 1, b = 2, c = 3;
	cout << "a = " << a << "\tb = " << b << "\tc = " << c << endl;
	
	//为了让读者理解得更清楚，程序中故意把每一道题都拆开求解，以展示中间计算结果。
	//而且在源代码中故意加入一些空格使各个表达式上下对齐，方便查看。（读者不需如此） 
	cout << "\n(1)\n";
	cout << "(a > b)            = " << (a > b)              << endl;
	cout << "           (b > c) = " <<             (b > c)  << endl;
	cout << "(a > b) && (b > c) = " << ((a > b) && (b > c)) << endl;
	
	cout << "\n(2)\n";
	cout << "(a > b)                 = " << (a > b)                   << endl;
	cout << "           !(a < b < c) = " <<             !(a < b < c)  << endl;
	cout << "(a > b) || !(a < b < c) = " << ((a > b) || !(a < b < c)) << endl;
	
	cout << "\n(3)\n";
	cout << "!(a && b)              = " << !(a && b)                << endl;
	cout << "             !(b || c) = " <<               !(b || c)  << endl;
	cout << "!(a && b) || !(b || c) = " << (!(a && b) || !(b || c)) << endl;
	
	cout << "\n(4)\n";
	cout << "!(a + b < c)                   = " << (!(a + b < c)) << endl;
	cout << "                b <= c * a - b = " << (b <= c * a - b) << endl;
	cout << "!(a + b < c) && b <= c * a - b = " << (!(a + b < c) && b <= c * a - b) << endl;
	
	cout << "\n(5)\n";
	cout << "       (b || c)        = " << (b || c) << endl;
	cout << "     !((b || c) && !a) = " << (!((b || c) && !a)) << endl;
	cout << "a && !((b || c) && !a) = " << (a && !((b || c) && !a)) << endl;
	
    return 0;
}

