/*********************************************************************
程序名：计算条件表达式的值 
版权：遵从GPL版权协议，可自由使用和传播（请勿上传到收费性网络文库）
作者：anbangli@foxmail.com
日期：2019-08-09
说明：
3-5.假设整型变量 a 的值是 1，b 的值是 2，c 的值是 4，在这种情况下先人工
分析分别执行下面各条语句之后整型变量 k 的值，然后编写程序输出 k 的值，
验证人工计算结果是否正确。
(1) k = a ? b : c;
(2) k = (a == 2) ? b + a : c + a;
(3) k = (a = 2) ? b + a : c + a;
(4) k = !(a && b) || c ? a || b : a && b && c

解题分析：按照条件表达式的求值规则，逐个求值。 
**********************************************************************/
#include <iostream>
using namespace std;

int main() {
	cout << "计算条件表达式的值\n" ;
	
	int a = 1, b = 2, c = 4, k;
	cout << "a = " << a << "\tb = " << b << "\tc = " << c << endl;
	
	k = a ? b : c;
	cout << "\n(1)  k = a ? b : c; \tk = " << k << endl;
	
	k = (a == 2) ? b + a : c + a;
	cout << "\n(2)  k = (a == 2) ? b + a : c + a; \tk = " << k << endl;
	
	k = (a = 2) ? b + a : c + a;	//注意此处的“a=2”是一个赋值表达式 
	cout << "\n(3)  k = (a = 2) ? b + a : c + a; \tk = " << k << endl;
	
	k = !(a && b) || c ? a && !b : b || !c; 
	cout << "\n(4)  k = !(a && b) || c ? a && !b : b || !c; \tk = " << k << endl;
	//此题较难，详述如下
	cout << "\t !(a && b) || c  求值为：" << (!(a && b) || c) << endl;
	cout << "\t a && !b  求值为：" << (a && !b) << endl;
	cout << "\t b || !c  求值为：" << (b || !c) << endl;
	 
    return 0;
}

