/*********************************************************************
程序名：求圆柱体的底面积、体积和表面积
版权：遵从GPL版权协议，可自由使用和传播（请勿上传到收费性网络文库）
作者：anbangli@foxmail.com
日期：2019-08-09
说明：
prog3-3.圆柱体的底部半径为r、高底为h，让用户从键盘上输入r和h，然后分别
求出圆柱体的底面积、体积和表面积。
*********************************************************************/
#include <iostream>
using namespace std;

int main() {
	double r, h;

	cout << "Please input the radius and height of a cylinder: " ;
	cin >> r >> h;

	cout << "底面积 = " << 3.14159265 * r *r << " m^2" << endl;
	cout << "体  积 = " << 3.14159265 * r *r *h << " m^3" << endl;
	cout << "表面积 = " << 3.14159265 * r *r * 2 +  2 * 3.14159265 * r *h << " m^2" << endl;

	return 0;
}
