/*********************************************************************
程序名：百马百瓦问题
版权：遵从GPL版权协议，可自由使用和传播（请勿上传到收费性网络文库）
作者：anbangli@foxmail.com
日期：2019-08-09
说明：
prog3-17.“百马百瓦问题”：有 100 匹马共驮 100 块瓦，其中每匹大马驮 3 块，
每匹小马驮 2 块，每两个马驹驮 1 块。编程求出大马、小马和马驹各有多少匹。
*********************************************************************/
#include <iostream>
using namespace std;

int main() {
	int a, b, c, t = 100;	//大马, 小马, 马驹, 总数(total)

	//解法一：让 a、b 和 c 进行三重循环。注意它们的最大值分别为 t/3、t/2 和 t。
	int num = 0; //解的组数
	for (a = 1; a <= t / 3; a++)
		for (b = 1; b <= t / 2; b++)
			for (c = 0; c <= t; c += 2)  //马驹最小数量为 0，每次增加 2
				if ( (a + b + c == t) && (a * 3 + b * 2 + c / 2 == t) ) {
					//不要写成 a*3 + b*2 + c*0.5 == t。避免出现比较浮点数与整数是否相等。
					cout << "大马, 小马, 马驹: " << a << "\t" << b << "\t" << c << "\n";
					num ++;
				}
	cout << "共有 " << num << " 组解\n\n";

	//解法二：让 a 和 b 进行二重循环。则 c = t - a - b ，且 c 必为偶数
	num = 0; //解的组数
	for (a = 1; a <= t / 3; a++)
		for (b = 1; b <= t / 2; b++)  {
			c = t - a - b;
			if ((c % 2 == 0) && (a * 3 + b * 2 + c / 2 == t))  {
				cout << "大马, 小马, 马驹: " << a << "\t" << b << "\t" << c << "\n";
				num ++;
			}
		}
	cout << "共有 " << num << " 组解\n\n";
	return 0;
}

