/*********************************************************************
程序名：读取纯文本文件并统计各个字符的出现次数
版权：遵从GPL版权协议，可自由使用和传播（请勿上传到收费性网络文库）
作者：anbangli@foxmail.com
日期：2019-07-22
说明：6-1.使用标准库中提供的随机数生成函数，生成100个介于[0, 200]之间的
随机整数，存放到一个整型数组中。然后依次输出这个整型数组中的所有元素。
*********************************************************************/
#include <iostream>
#include <cstdlib>
#include <ctime>
using namespace std;

int main () {
	const int N = 100;
	int a[N] = {0};  //第0号元素初始化为0，其它元素自动初始化为0

	srand(time(0));
	cout << "Generate " << N << " rand integers:" << endl;
	for (int i = 0; i < N; i++)
		a[i] = rand() % (200 + 1);

	for (int i = 0; i < N; i++)
		cout << a[i] << (i % 10 == 9 ? '\n' : '\t');

	return 0;
}


